# 1. hello 출력
# print('Hello')
#######################################################
# 2. Hello World 출력
# print("Hello World")
#######################################################
# 3. Hello \n World 출력
# print("Hello"+'\n'+'World')
#######################################################
# 4. 'Hello' 출력
# print("'Hello'")
#######################################################
# 5. "Hello World" 출력
# print('"Hello World"')
#######################################################
# 6. "!@#$%^&*()' 출력
# print('"!@#$%^&*()'+"'")

#######################################################
# 7. "C:\Download\'hello'.py" 출력
# print('"C:\\Download' + "\\"+"'hello'"+'.py"')
#######################################################
# 8. print("Hello\nWorld") 출력
# print('print("Hello\\nWorld")')
#######################################################
# 9. 입 출력 기초
# print(input())
#######################################################
# 10. 변수에 정수값을 저장한 후 정수로 변환하여 출력
# print(int(input())
#######################################################
# 11. 변수에 실수값 저장 후 그대로 출력
# print(float(input()))
#######################################################
# 12. 줄을 바꿔 정수(integer) 2개를 입력받아 줄을 바꿔 출력해보자.
# print(input())
# print(input())
#######################################################
# 13. 줄을 바꿔 문자(character) 2개를 입력받고, 순서를 바꿔 한 줄씩 출력해보자.
# a = input()
# b = input()
# print(b)
# print(a)
#######################################################
# 14. 실수(real number) 1개를 입력받아 줄을 바꿔 3번 출력해보자.
# a = float(input())
# for i in range(3): print(a)
#######################################################
# 15. 공백을 두고 입력된정수(integer) 2개를 입력받아 줄을 바꿔 출력해보자.
# a,b = input().split()
# print(a)
# print(b)
#######################################################
# 16. 공백을 두고 문자(character) 2개를 입력받아 순서를 바꿔 출력해보자.
# a,b = input().split()
# print(b +'\n'+ a)
#######################################################
# 17. 정수(integer), 실수, 문자(character), 문자열(string) 등 1개만 입력받아 한 줄로 3번 출력해보자.
# a = input()
# print(a,a,a)
#######################################################
# 18. 24시간 시:분 형식으로 시간이 입력될 때, 그대로 출력하는 연습을 해보자.
# print(input())
#######################################################
# 19. "연도.월.일"을 입력받아 "일-월-연도" 순서로 바꿔 출력해보자.
# y,m,d = input().split('.')
# print(d+'-'+m+'-'+y)
#######################################################
# 20. 주민번호를 입력받아 형태를 바꿔 출력해보자.
# print(input().replace('-',''))
#######################################################
# 21. 입력받은 단어의 각 문자를 한 줄에 한 문자씩 분리해 출력한다.
# a = input()
# for i in range(len(a)):
#     print(a[i])
#######################################################
# 22. 6자리의 연월일(YYMMDD)을 입력받아 나누어 출력해보자.
# a = input()
# for i in range(len(a)):
#     print(a[i],end='')
#     if (i+1) % 2 == 0:
#         print(' ',end='')
#######################################################
# 23. 시:분:초 형식으로 시간이 입력될 때 분만 출력해보자.
# a,b,c = input().split(':')
# print(b)
#######################################################
# 24. 알파벳 문자와 숫자로 이루어진 단어 2개를 입력받아 순서대로 붙여 출력하는 프로그램을 작성해보자.
# a,b = input().split(' ')
# print(a+b)
#######################################################
# 25. 정수 2개를 입력받아 합을 출력하는 프로그램을 작성해보자.
# a,b = input().split()
# print(int(a)+int(b))
#######################################################
# 26. 실수 2개를 입력받아 합을 출력하는 프로그램을 작성해보자.
# print(float(input()) + float(input()))
#######################################################
# 27. 10진수를 입력받아 16진수(hexadecimal)로 출력해보자.
# print('%x'% int(input()))
#######################################################
# 28. 10진수를 입력받아 16진수(hexadecimal)로 출력해보자.
# print('%X'% int(input()))
#######################################################
# 29. 16진수를 입력받아 8진수(octal)로 출력해보자.
# print('%o'% int(input(),16))
#######################################################
# 30. 영문자 1개를 입력받아 10진수 유니코드(Unicode) 값으로 출력해보자.
# print(ord(input()))
#######################################################
# 31. 10진 정수 1개를 입력받아 유니코드 문자로 출력해보자.
# print(chr(int(input())))
#######################################################
# 32. 입력된 정수의 부호를 바꿔 출력해보자.
# print(-int(input()))
#######################################################
# 33. 문자 1개를 입력받아 그 다음 문자를 출력해보자.
# print(chr(ord(input())+1))
#######################################################
# 34. 정수 2개(a, b)를 입력받아 a에서 b를 뺀 차를 출력하는 프로그램을 작성해보자.
# a,b = input().split()
# print(int(a) - int(b))
#######################################################
# 35. 실수 2개(f1, f2)를 입력받아 곱을 출력하는 프로그램을 작성해보자.
# a,b = input().split()
# print(float(a) * float(b))
#######################################################
# 36. 단어와 반복 횟수를 입력받아 여러 번 출력해보자.
# a, b = input().split()
# for i in range(int(b)):
#     print(a,end='')
#######################################################
# 37. 반복 횟수와 문장을 입력받아 여러 번 출력해보자.
# a = int(input())
# b = input()
# for i in range(a):
#     print(b,end='')
#######################################################
# 38. 정수 2개(a, b)를 입력받아 a를 b번 곱한 거듭제곱을 출력하는 프로그램을 작성해보자.
# a,b = input().split()
# print(int(a) ** int(b))
#######################################################
# 39. 실수 2개(f1, f2)를 입력받아 f1을 f2번 거듭제곱한 값을 출력하는 프로그램을 작성해보자.
# a,b = input().split()
# print(float(a) ** float(b))
#######################################################
# 40. 정수 2개(a, b) 를 입력받아 a를 b로 나눈 몫을 출력해보자.
# a, b = input().split()
# print(int(a) // int(b))
#######################################################
# 41. 정수 2개(a, b) 를 입력받아 a를 b로 나눈 나머지를 출력해보자.
# a, b = input().split()
# print(int(a) % int(b))
#######################################################
# 42. 실수 1개를 입력받아 소숫점 이하 두 번째 자리까지의 정확도로 반올림한 값을 출력해보자.
# print(format(float(input()),".2f"))
#######################################################
# 42일차. 실수 2개(f1, f2)를 입력받아 f1 을 f2 로 나눈 값을 출력해보자. 이 때 소숫점 넷째자리에서 반올림하여 무조건 소숫점 셋째 자리까지 출력한다.
# a,b = input().split()
# c = float(a) / float(b)
# print(format(c,".3f"))
#######################################################
# 44. 정수 2개(a, b)를 입력받아 합, 차, 곱, 몫, 나머지, 나눈 값을 자동으로 계산해보자.
# a, b = map(int, input().split())
# print(a + b)
# print(a - b)
# print(a * b)
# print(a // b)
# print(a % b)
# print('%.2f' %(a/b))
#######################################################
# 45. 정수 3개를 입력받아 합과 평균을 출력해보자.
# a,b,c = map(int,input().split())
# print(a+b+c,end=' ')
# print('%.2f' %((a+b+c)/3))
#######################################################
# 46. 정수 1개를 입력받아 2배 곱해 출력해보자.
# print(int(input())*2)
#print(n<<1)  #10을 2배 한 값인 20 이 출력된다.
# print(n>>1)  #10을 반으로 나눈 값인 5 가 출력된다.
# print(n<<2)  #10을 4배 한 값인 40 이 출력된다.
# print(n>>2)  #10을 반으로 나눈 후 다시 반으로 나눈 값인 2 가 출력된다.
#######################################################
# 47. 정수 2개(a, b)를 입력받아 a를 2b배 곱한 값으로 출력해보자.
# a,b = map(int,input().split())
# print(a<<b)
#######################################################
# 48. 두 정수(a, b)를 입력받아 a가 b보다 작으면 True 를, a가 b보다 크거나 같으면 False 를 출력하는 프로그램을 작성해보자.
# a,b = map(int,input().split())
# print(a<b)
#######################################################
# 49. 두 정수(a, b)를 입력받아 a와 b의 값이 같으면 True 를, 같지 않으면 False 를 출력하는 프로그램을 작성해보자.
# a,b = map(int,input().split())
# print(a==b)
#######################################################
# 50. 두 정수(a, b)를 입력받아 b의 값이 a의 값 보다 크거나 같으면 True 를, 같지 않으면 False 를 출력하는 프로그램을 작성해보자.
# a,b = map(int,input().split())
# print(a<=b)
#######################################################


#######################################################

#######################################################

#######################################################

#######################################################

#######################################################
